; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v7 ?v1)
             (pred_6 ?v8 ?v13)
             (pred_11 ?v7 ?v13)
             (pred_1 ?v6 ?v7 )
	     (pred_8 ?v7)
             (pred_3 ?v10)
             (pred_7 ?v8)
             (pred_2 ?v13)
             (pred_5 ?v7)
             (pred_10 ?v8)
             (pred_4 ?v7)
             (pred_12 ))



(:action op_3
:parameters (?v2 ?v9 ?v3 ?v5)
:precondition (and (pred_3 ?v2) (pred_3 ?v9) (pred_7 ?v3) (pred_2 ?v5)
          (pred_9 ?v2 ?v9) (pred_6 ?v3 ?v5)
                   (pred_11 ?v9 ?v5) (pred_8 ?v2) 
                   (pred_5 ?v9) (pred_10 ?v3))
:effect (and  (pred_4 ?v9) (not (pred_5 ?v9))))


(:action op_1
:parameters (?v2 ?v12)
:precondition (and (pred_3 ?v2) (pred_3 ?v12)
               (pred_8 ?v2) (pred_9 ?v2 ?v12) (pred_4 ?v12))
:effect (and (pred_8 ?v12) (not (pred_8 ?v2))))

(:action op_5
:parameters (?v2 ?v3)
:precondition (and (pred_3 ?v2) (pred_7 ?v3) 
                  (pred_8 ?v2) (pred_1 ?v3 ?v2) (pred_12 ))
:effect (and (pred_10 ?v3)
   (not (pred_1 ?v3 ?v2)) (not (pred_12 ))))


(:action op_4
:parameters (?v2 ?v4 ?v11)
:precondition (and (pred_3 ?v2) (pred_7 ?v4) (pred_7 ?v11)
                  (pred_8 ?v2) (pred_10 ?v11) (pred_1 ?v4 ?v2))
:effect (and (pred_10 ?v4) (pred_1 ?v11 ?v2)
        (not (pred_10 ?v11)) (not (pred_1 ?v4 ?v2))))

(:action op_2
:parameters (?v2 ?v3)
:precondition (and (pred_3 ?v2) (pred_7 ?v3) 
                  (pred_8 ?v2) (pred_10 ?v3))
:effect (and (pred_12 ) (pred_1 ?v3 ?v2) (not (pred_10 ?v3)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_10 obj_14 obj_05 obj_30 obj_17 obj_21 obj_15 obj_22 obj_16 obj_04 obj_25 obj_28 obj_29 obj_01 obj_02 obj_07 obj_12 obj_13 obj_18 obj_09 obj_26 obj_27 obj_06 obj_19 obj_03
    obj_08 obj_23
    obj_20 obj_24 obj_11
    )

    (:init
       (pred_12)

       (pred_3 obj_10)
       (pred_3 obj_14)
       (pred_3 obj_05)
       (pred_3 obj_30)
       (pred_3 obj_17)
       (pred_3 obj_21)
       (pred_3 obj_15)
       (pred_3 obj_22)
       (pred_3 obj_16)
       (pred_3 obj_04)
       (pred_3 obj_25)
       (pred_3 obj_28)
       (pred_3 obj_29)
       (pred_3 obj_01)
       (pred_3 obj_02)
       (pred_3 obj_07)
       (pred_3 obj_12)
       (pred_3 obj_13)
       (pred_3 obj_18)
       (pred_3 obj_09)
       (pred_3 obj_26)
       (pred_3 obj_27)
       (pred_3 obj_06)
       (pred_3 obj_19)
       (pred_3 obj_03)
       (pred_2 obj_08)
       (pred_2 obj_23)
       (pred_7 obj_20)
       (pred_7 obj_24)
       (pred_7 obj_11)

       (pred_9 obj_10 obj_21)
       (pred_9 obj_10 obj_14)
       (pred_9 obj_14 obj_15)
       (pred_9 obj_14 obj_05)
       (pred_9 obj_14 obj_10)
       (pred_9 obj_05 obj_22)
       (pred_9 obj_05 obj_30)
       (pred_9 obj_05 obj_14)
       (pred_9 obj_30 obj_16)
       (pred_9 obj_30 obj_17)
       (pred_9 obj_30 obj_05)
       (pred_9 obj_17 obj_04)
       (pred_9 obj_17 obj_30)
       (pred_9 obj_21 obj_25)
       (pred_9 obj_21 obj_15)
       (pred_9 obj_21 obj_10)
       (pred_9 obj_15 obj_28)
       (pred_9 obj_15 obj_22)
       (pred_9 obj_15 obj_14)
       (pred_9 obj_15 obj_21)
       (pred_9 obj_22 obj_29)
       (pred_9 obj_22 obj_16)
       (pred_9 obj_22 obj_05)
       (pred_9 obj_22 obj_15)
       (pred_9 obj_16 obj_01)
       (pred_9 obj_16 obj_04)
       (pred_9 obj_16 obj_30)
       (pred_9 obj_16 obj_22)
       (pred_9 obj_04 obj_02)
       (pred_9 obj_04 obj_17)
       (pred_9 obj_04 obj_16)
       (pred_9 obj_25 obj_07)
       (pred_9 obj_25 obj_28)
       (pred_9 obj_25 obj_21)
       (pred_9 obj_28 obj_12)
       (pred_9 obj_28 obj_29)
       (pred_9 obj_28 obj_15)
       (pred_9 obj_28 obj_25)
       (pred_9 obj_29 obj_13)
       (pred_9 obj_29 obj_01)
       (pred_9 obj_29 obj_22)
       (pred_9 obj_29 obj_28)
       (pred_9 obj_01 obj_18)
       (pred_9 obj_01 obj_02)
       (pred_9 obj_01 obj_16)
       (pred_9 obj_01 obj_29)
       (pred_9 obj_02 obj_09)
       (pred_9 obj_02 obj_04)
       (pred_9 obj_02 obj_01)
       (pred_9 obj_07 obj_26)
       (pred_9 obj_07 obj_12)
       (pred_9 obj_07 obj_25)
       (pred_9 obj_12 obj_27)
       (pred_9 obj_12 obj_13)
       (pred_9 obj_12 obj_28)
       (pred_9 obj_12 obj_07)
       (pred_9 obj_13 obj_06)
       (pred_9 obj_13 obj_18)
       (pred_9 obj_13 obj_29)
       (pred_9 obj_13 obj_12)
       (pred_9 obj_18 obj_19)
       (pred_9 obj_18 obj_09)
       (pred_9 obj_18 obj_01)
       (pred_9 obj_18 obj_13)
       (pred_9 obj_09 obj_03)
       (pred_9 obj_09 obj_02)
       (pred_9 obj_09 obj_18)
       (pred_9 obj_26 obj_27)
       (pred_9 obj_26 obj_07)
       (pred_9 obj_27 obj_06)
       (pred_9 obj_27 obj_12)
       (pred_9 obj_27 obj_26)
       (pred_9 obj_06 obj_19)
       (pred_9 obj_06 obj_13)
       (pred_9 obj_06 obj_27)
       (pred_9 obj_19 obj_03)
       (pred_9 obj_19 obj_18)
       (pred_9 obj_19 obj_06)
       (pred_9 obj_03 obj_09)
       (pred_9 obj_03 obj_19)
       (pred_5 obj_12)
       (pred_5 obj_28)
       (pred_5 obj_17)
       (pred_11  obj_12 obj_08)
       (pred_11  obj_28 obj_23)
       (pred_11  obj_17 obj_08)
       (pred_4 obj_10)
       (pred_4 obj_14)
       (pred_4 obj_05)
       (pred_4 obj_30)
       (pred_4 obj_21)
       (pred_4 obj_15)
       (pred_4 obj_22)
       (pred_4 obj_16)
       (pred_4 obj_04)
       (pred_4 obj_25)
       (pred_4 obj_29)
       (pred_4 obj_01)
       (pred_4 obj_02)
       (pred_4 obj_07)
       (pred_4 obj_13)
       (pred_4 obj_18)
       (pred_4 obj_09)
       (pred_4 obj_26)
       (pred_4 obj_27)
       (pred_4 obj_06)
       (pred_4 obj_19)
       (pred_4 obj_03)

       (pred_6  obj_20 obj_08)
       (pred_6  obj_24 obj_23)
       (pred_6  obj_11 obj_08)
       (pred_1 obj_20 obj_02)
       (pred_1 obj_24 obj_25)
       (pred_1 obj_11 obj_18)
       (pred_8 obj_04)
    )

    (:goal (and
       (pred_1 obj_20 obj_27)
       (pred_1 obj_11 obj_12)
    ))
(:constraints
  (always (not (pred_8 obj_13)))
)
)

; plan
1. (op_1 obj_04 obj_02)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_02)
   goals met: 0 of 2
2. (op_5 obj_02 obj_20)
   deleted: (pred_1 obj_20 obj_02) (pred_12)
   added: (pred_10 obj_20)
   goals met: 0 of 2
3. (op_1 obj_02 obj_09)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_09)
   goals met: 0 of 2
4. (op_1 obj_09 obj_18)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_18)
   goals met: 0 of 2
5. (op_1 obj_18 obj_19)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_19)
   goals met: 0 of 2
6. (op_1 obj_19 obj_06)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_06)
   goals met: 0 of 2
7. (op_1 obj_06 obj_27)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_27)
   goals met: 0 of 2
8. (op_3 obj_27 obj_12 obj_20 obj_08)
   deleted: (pred_5 obj_12)
   added: (pred_4 obj_12)
   goals met: 0 of 2
9. (op_2 obj_27 obj_20)
   deleted: (pred_10 obj_20)
   added: (pred_12) (pred_1 obj_20 obj_27)
   goals met: 1 of 2
10. (op_1 obj_27 obj_06)
   deleted: (pred_8 obj_27)
   added: (pred_8 obj_06)
   goals met: 1 of 2
11. (op_1 obj_06 obj_19)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_19)
   goals met: 1 of 2
12. (op_1 obj_19 obj_18)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_18)
   goals met: 1 of 2
13. (op_5 obj_18 obj_11)
   deleted: (pred_1 obj_11 obj_18) (pred_12)
   added: (pred_10 obj_11)
   goals met: 1 of 2
14. (op_1 obj_18 obj_19)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_19)
   goals met: 1 of 2
15. (op_1 obj_19 obj_06)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_06)
   goals met: 1 of 2
16. (op_1 obj_06 obj_27)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_27)
   goals met: 1 of 2
17. (op_1 obj_27 obj_12)
   deleted: (pred_8 obj_27)
   added: (pred_8 obj_12)
   goals met: 1 of 2
18. (op_2 obj_12 obj_11)
   deleted: (pred_10 obj_11)
   added: (pred_12) (pred_1 obj_11 obj_12)
   goals met: 2 of 2
